package thread;

	// 멀티 쓰레

public class ThreadEx5 {
	static long startTime = 0;
	
	public static void main(String[] args) {
		ThreadEx5_1 th1 = new ThreadEx5_1();
		th1.start();
		startTime = System.currentTimeMillis();
		
		for(int i=0; i<300; i++)
			System.out.printf("%s", new String("-"));
		
		System.out.print("소요시간1:"+ (System.currentTimeMillis()-ThreadEx5.startTime));
	}
}

class ThreadEx5_1 extends Thread {
	public void run() {
		for(int i=0; i < 300; i++)
			System.out.printf("%s", new String("|"));
		
		System.out.print("소요시간2:"+ (System.currentTimeMillis()-ThreadEx5.startTime));
	}
}

// 실행결과
//------------------------------|||||||||||||||||||||||||||||||||||||||||||----------------------------|||||||||||||||||||||||||
//-----------------------------------------------------------------------------------------------------|||||||||||||||||||||||||
//|||||||||||||||||||||||||||||||||||||||||||||||------------------------------------------|||||||||||||||||||||||||||||||||||||
//|||||||||||||||||||-|--||||||||---||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
//|||----------------------소요시간2:62-----------------------------------------------------------------------소요시간1:75

// 멀티 쓰레드의 경우 싱글 쓰레드와 달리 두 작업이 아주 짧은 시간동안 번갈아가면서 실행되었으며 거의 동시에 작업이 완료되었음을 알 수 있다.